export const md = `
# マシンリーダビリティ
WCAGのレベルA基準において、マシンリーダビリティ（機械可読）は多くのガイドラインに紐づいています。
PDFや画像ファイルは、視覚情報のある人間にとっては認識可能ですが、コンピューターにとっては読み取りづらい形式になります。コンピューターやプログラムが読み取れないデータ形式である場合、殆どの支援技術が機能しなくなるので、それらを用いているユーザーはサイトを利用することが出来なくなります。

WCAGのレベルA基準は以下のようなものになります。
・**視覚に頼らずとも情報が得られるテキストを用意する**
・**そのテキストを意味に沿った順番に並べ、内容に応じて適切なHTMLとしてマークアップする**
・**どこが入力エラーになっているかをテキストで伝える**
・**すべてのインタラクティブ要素をキーボードで操作可能にする**
***
## マシンリーダブルの基礎
以下のようなアイコン画像のみのボタンがあります。
![test](/02/readable_icon.png)
視覚情報がある場合、プラスは何らかの加算を意味し、ゴミ箱は破棄を意味すると連想できます。また、角丸の矩形からはボタンである事が認知できます。
以下は読み上げられる実装の例です。セマンティクスが実装されています。
`

export const text = {
  1: `
  視覚情報がある場合、プラスは何らかの加算を意味し、ゴミ箱は破棄を意味すると連想できます。また、角丸の矩形からはボタンである事が認知できます。
  以下は読み上げられる実装の例です。セマンティクスが実装されています。
  ---
  ***
  ![test](/readable_icon.png)
  `,
  2: `
  ボタンにはbutton要素が用いられ、button要素の中にimg要素があり、alt属性によって代替テキストが付与されています。
  スクリーンリーダーはこれらの構成から情報を読み取り、「追加、ボタン」と読まれます。
  以下のような実装はスクリーンリーダーで読み上げられません。
  `,
  3: `
  div要素は特別な意味を持たないのでセマンティクスが読み取れず、SVGにはテキスト情報がありません。class属性にButtonやIcon-addを指定していますが、class属性の値はセマンティクスとして機能しません。
  `
};

export const code = {
  1: `
  <button class="Button">
    <img src="/image/icon/add.png" alt="追加" />
  </button>
  `,
  2: `
  <div class="Button">
    <svg class="Icon-add" viewBox="00512512"><pathd="M505..."/></svg>
  </div>
  `,
  3: `
  Webカメラを利用して、顔の向きや表情で画面を操作します。
  `
};
