export const heading = `WAI-ARIA`;

export const caption = `
障害には様々な種類があり、障害を補助するデバイスも多数存在しています。
デバイス以外にも、ユーザーはOSやブラウザの設定、拡張機能を駆使して、様々な補助を得ています。主に表示拡大、コントラスト、テキスト変換、読み上げ機能などです。
これらは障害者のみが利用するものではなく、一時的な障害（メガネを忘れたりして画面が見えない、手を怪我してマウス操作ができない、職場や電車の中で音を聞く事が出来ないなど）によって、誰もが利用する状況になり得ます。
`;

export const text = {
  1: `
  視覚障害などで画面が見えない場合、カーソル位置を常に認知するマウス操作は困難になります。そのため、全盲の利用者はキーボードであらゆる操作と入力を行います。画面の状況や、今行える操作が何か、入力した文字が何かといった把握は、すべて音声の読み上げによって行います。
  `,
  2: `
  タッチスクリーンやキーボードなどを、口にくわえた棒状のポインタで操作します。
  `,
  3: `
  Webカメラを利用して、顔の向きや表情で画面を操作します。
  `
};

export const code_01 = `
<link rel="shortcut icon sfdy sdfyhesy eryeryeryeryherh dfehrh reuhyerwherherher" sizes="16x16" href="">
`;
