export const md = `
# WCAG
**Web Content Accessibility Guidelines** の略で、W3C が発行しているアクセシビリティに関するガイドラインです。
WCAG2.1（執筆時点）が対象としているのは、「**Web技術を使ったコンテンツすべて**」です。WebサイトやWebアプリケーションは当然として、ほかにもネイティブアプリケーション上で表示しているWebページや、HTML製のヘルプ、電子書籍フォーマットのEPUB、PDFなどもすべて対象になります。
***
## 4つの原則
WCAG2.1では、4つの原則と、その原則を個別に分解したガイドライン、それらに対する取り組みを示した達成基準、という構成になっています。

原則は以下の4つです。
**・1.知覚可能**
情報及びユーザインタフェースコンポーネントは、利用者が知覚できる方法で利用者に提示可能でなければならない

**・2.操作可能**
ユーザインタフェースコンポーネント及びナビゲーションは操作可能でなければならない

**・3.理解可能**
情報及びユーザインタフェースの操作は理解可能でなければならない

**・4.堅牢**
コンテンツは、支援技術を含む様々なユーザエージェントが確実に解釈できるように十分に堅牢（robust）でなければならない

多様な状況を前提として、デバイスや環境依存によらず以下を満たすことが求められます。
**・そこに情報やUIがあると知覚できること**
**・そのUIやナビゲーションが操作できること**
**・ページ上の情報や、UIの操作に関する情報が理解できること**
**・標準仕様にのっとって実装することで、互換性を最大化すること**
***
## ガイドライン
***
## 達成基準
`

export const text = {
  1: `
  WCAG2.1では、4つの原則と、その原則を個別に分解したガイドライン、それらに対する取り組みを示した達成基準、という構成になっています。
  原則は以下の4つです。

  **・1.知覚可能**
  情報及びユーザインタフェースコンポーネントは、利用者が知覚できる方法で利用者に提示可能でなければならない

  **・2.操作可能**
  ユーザインタフェースコンポーネント及びナビゲーションは操作可能でなければならない

  **・3.理解可能**
  情報及びユーザインタフェースの操作は理解可能でなければならない

  **・4.堅牢**
  コンテンツは、支援技術を含む様々なユーザエージェントが確実に解釈できるように十分に堅牢（robust）でなければならない

  多様な状況を前提として、デバイスや環境依存によらず以下を満たすことが求められます。
  **・そこに情報やUIがあると知覚できること**
  **・そのUIやナビゲーションが操作できること**
  **・ページ上の情報や、UIの操作に関する情報が理解できること**
  **・標準仕様にのっとって実装することで、互換性を最大化すること**
  `,
  2: `

  `,
  3: `

  `
};

